Tekla Open API Reference for Tekla Structures 2025
UserPropertyFieldTypeEnum Enumeration
The user property field type.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum UserPropertyFieldTypeEnum
Public Enumeration UserPropertyFieldTypeEnum
Members
Member name | Value | Description
FIELDTYPE_UNDEFINED | 0 |  The user property field type is undefined.
FIELDTYPE_NUMBER | 1 |  The user property field type is number.
FIELDTYPE_TEXT | 2 |  The user property field type is text.
FIELDTYPE_DISTANCE | 3 |  The user property field type is distance.
FIELDTYPE_PROFILE | 4 |  The user property field type is profile.
FIELDTYPE_MATERIAL | 5 |  The user property field type is material.
FIELDTYPE_TEXT_LIST_DISTANCE | 6 |  The user property field type is distance list.
FIELDTYPE_FILE_IN | 7 |  The user property field type is file in.
FIELDTYPE_FILE_OUT | 8 |  The user property field type is file out.
FIELDTYPE_BOLT_STANDARD | 9 |  The user property field type is bolt standard.
FIELDTYPE_BOLT_SIZE | 10 |  The user property field type is bolt size.
FIELDTYPE_RATIO | 11 |  The user property field type is ratio.
FIELDTYPE_STRAIN | 12 |  The user property field type is strain.
FIELDTYPE_ANGLE | 13 |  The user property field type is angle.
FIELDTYPE_DEFORMATION | 14 |  The user property field type is deformation.
FIELDTYPE_DIMENSION | 15 |  The user property field type is dimension.
FIELDTYPE_RADIUSOFINERTIA | 16 |  The user property field type is radius of inertia.
FIELDTYPE_AREA | 17 |  The user property field type is area.
FIELDTYPE_AREAPERLENGTH | 18 |  The user property field type is area/length.
FIELDTYPE_SECTIONMODULUS | 19 |  The user property field type is section modulus.
FIELDTYPE_MOMENTOFINERTIA | 20 |  The user property field type is moment of inertia.
FIELDTYPE_TORSIONCONSTANT | 21 |  The user property field type is torsion constant.
FIELDTYPE_WARPINGCONSTANT | 22 |  The user property field type is warping constant.
FIELDTYPE_FORCE | 23 |  The user property field type is force.
FIELDTYPE_WEIGHT | 24 |  The user property field type is weight.
FIELDTYPE_DISTRIBLOAD | 25 |  The user property field type is distributed load.
FIELDTYPE_SPRINGCONSTANT | 26 |  The user property field type is spring constant.
FIELDTYPE_SURFACELOAD | 27 |  The user property field type is surface load.
FIELDTYPE_STRENGTH | 28 |  The user property field type is strength.
FIELDTYPE_MODULUS | 29 |  The user property field type is modulus.
FIELDTYPE_DENSITY | 30 |  The user property field type is density.
FIELDTYPE_MOMENT | 31 |  The user property field type is moment.
FIELDTYPE_DISTRIBMOMENT | 32 |  The user property field type is distributed moment.
FIELDTYPE_ROTSPRINGCONST | 33 |  The user property field type is rotational spring constant.
FIELDTYPE_TEMPERATURE | 34 |  The user property field type is temperature.
FIELDTYPE_THERMDILATCOEFF | 35 |  The user property field type is thermal coefficient.
FIELDTYPE_ANALYSIS_RESTRAINT | 36 |  The user property field type is analysis restraint.
FIELDTYPE_VOLUME | 37 |  The user property field type is volume.
FIELDTYPE_REBAR_MAIN | 38 |  The user property field type is main reinforcement bar.
FIELDTYPE_REBAR_STIRRUP | 39 |  The user property field type is stirrup reinforcement bar.
FIELDTYPE_DATE | 40 |  The user property field type is date.
FIELDTYPE_DATE_TIME_SEC | 41 |  The user property field type is date and time with seconds.
FIELDTYPE_DATE_TIME_MIN | 42 |  The user property field type is date and time with minutes.
FIELDTYPE_STUD_STANDARD | 43 |  The user property field type is stud standard.
FIELDTYPE_STUD_SIZE | 44 |  The user property field type is stud size.
FIELDTYPE_STUD_LENGTH | 45 |  The user property field type is stud length.
FIELDTYPE_HOLE_TYPE | 46 |  The user property field type is hole type.
FIELDTYPE_HOLE_DIRECTION | 47 |  The user property field type is hole direction.
FIELDTYPE_WELD_TYPE | 48 |  The user property field type is weld type.
FIELDTYPE_CHAMFER_TYPE | 49 |  The user property field type is chamfer type.
FIELDTYPE_WELDING_SITE | 50 |  The user property field type is welding site.
FIELDTYPE_FACTOR | 51 |  The user property field type is factor.
FIELDTYPE_PART_NAME | 52 |  The user property field type is part name.
FIELDTYPE_BOLT_TYPE | 53 |  The user property field type is bolt type.
FIELDTYPE_COMPONENT_NAME | 54 |  The user property field type is component name.
FIELDTYPE_REBAR_MESH | 55 |  The user property field type is rebar mesh.
FIELDTYPE_USERDEFINED | 56 |  The user property field type is user defined.
FIELDTYPE_YES_NO | 57 |  The user property field type is yes/no.
FIELDTYPE_COMPONENT_STANDARD_FILE | 58 |  The user property field type is component standard file.
FIELDTYPE_REBAR_GRADE | 59 |  The user property field type is reinforcement bar grade.
FIELDTYPE_REBAR_RADIUS | 60 |  The user property field type is reinforcement bar radius.
FIELDTYPE_REBAR_SIZE | 61 |  The user property field type is reinforcement bar size.
FIELDTYPE_HOOK_SHAPE | 62 |  The user property field type is reinforcement bar hook shape.
FIELDTYPE_CROSSBAR_POSITION | 63 |  The user property field type is reinforcement cross bar position.
FIELDTYPE_REBAR_SPLIT_TARGET | 64 |  The user property field type is rebar split target.
FIELDTYPE_REBAR_STAGGER_TYPE | 65 |  The user property field type is rebar stagger type.
FIELDTYPE_REBAR_LAPPING_SIDE | 66 |  The user property field type is rebar lapping side.
FIELDTYPE_REBAR_LAPPING_OFFSET_DIRECTION | 67 |  The user property field type is rebar lapping offset direction.
FIELDTYPE_REBAR_LAPPING_OFFSET_TYPE | 68 |  The user property field type is rebar lapping offset type.
FIELDTYPE_DISTANCE_LIST_TOTAL | 69 |  The user property field type is distance list total.
FIELDTYPE_REBAR_LENGTH_ADJUSTMENT_TYPE | 70 |  The user property field type is rebar length adjustment type.
FIELDTYPE_SHAPE | 71 |  The user property field type is shape.
FIELDTYPE_PLAIN_HOLE_TYPE | 72 |  The user property field type is plain hole type.
FIELDTYPE_MASS_FLOW | 73 |  The user property field type is mass flow.
FIELDTYPE_VOLUME_FLOW | 74 |  The user property field type is volume flow.
FIELDTYPE_HEAT_CAPACITY | 75 |  The user property field type is heat capacity.
FIELDTYPE_PRESSURE_LOSS | 76 |  The user property field type is pressure loss.
FIELDTYPE_VELOCITY | 77 |  The user property field type is velocity.
FIELDTYPE_FLOW_COEFFICIENT | 78 |  The user property field type is flow coefficient.
FIELDTYPE_DYNAMIC_VISCOSITY | 79 |  The user property field type is dynamic viscosity.
FIELDTYPE_KINEMATIC_VISCOSITY | 80 |  The user property field type is kinematic viscosity.
FIELDTYPE_POWER | 81 |  The user property field type is power.
See Also
Reference
Tekla.Structures.Catalogs Namespace